app/controllers/match_controller.rb

	def new
		@user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		image_level = Image.where(level: params["level"]) # will return array of all images with level
		image = image_level.sample #returns random image from array above
		match = Match.new(player_one: session[:user_id], level: params["level"], image_id: image.id)
		match.save
---
SELECT  "images".* FROM "images" WHERE "images"."level" = $1 LIMIT 1  [["level", "intermediate"]]
INSERT INTO "matches" ("player_one", "level", "image_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["player_one", 1], ["level", "difficult"], ["image_id", 3], ["created_at", "2015-02-18 05:01:57.587714"], ["updated_at", "2015-02-18 05:01:57.587714"]]

	def view
		match = Match.find_by(id: params[:id])
		@user = User.find_by(id: match.player_one)
		@image = Image.find_by(id: match.image_id)
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", 2]]