app/controllers/users_controller.rb

	def view
		if session[:user_id] == (params[:id].to_i)
 			user = User.find_by(id: params[:id])
 			@matches = Match.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "matches".* FROM "matches"

	def create
		new_user = User.new({ fname: params["fname"], lname: params["lname"], email: params["email"], password: params[:password]})
		new_user.save
---
INSERT INTO "users" ("fname", "lname", "email", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["fname", "Alexander"], ["lname", "Boardman"], ["email", "alex@test.com"], ["password_digest", "$2a$10$hxiEOsxz4XulvBSL0jvJ0uhzA2fLGr7snEVCoWZ5pPWJkzAIC32Ka"]]